backend/app/models/payment.rb

UPDATE "payments" SET "status" = ?, "updated_at" = ? WHERE "payments"."id" = ?  [["status", "completed"], ["updated_at", "2025-03-11 01:10:37.303216"], ["id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "paid"], ["updated_at", "2025-03-11 01:10:37.305674"], ["id", 2]]
---
  def complete
    update(status: 'completed')
    order.update(status: 'paid')