backend/app/controllers/api/v1/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 2], ["product_id", 1], ["quantity", 2], ["price", 142.16], ["created_at", "2025-03-11 01:10:37.267979"], ["updated_at", "2025-03-11 01:10:37.267979"]]
---
  def create
    @order_item = @order.order_items.new(order_item_params)

    if @order_item.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_order
    @order = Order.find(params[:order_id])