backend/app/controllers/api/v1/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.status = 'pending'

    if @order.save
---
INSERT INTO "orders" ("user_id", "status", "total_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["status", "pending"], ["total_amount", 99.99], ["created_at", "2025-03-11 01:10:37.180300"], ["updated_at", "2025-03-11 01:10:37.180300"]]