backend/app/controllers/api/v1/payments_controller.rb

SELECT "payments".* FROM "payments" WHERE "payments"."order_id" = ? LIMIT ?  [["order_id", 2], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "paid"], ["updated_at", "2025-03-11 01:10:37.305674"], ["id", 2]]
UPDATE "payments" SET "status" = ?, "updated_at" = ? WHERE "payments"."id" = ?  [["status", "processing"], ["updated_at", "2025-03-11 01:10:37.300911"], ["id", 1]]
INSERT INTO "payments" ("order_id", "amount", "payment_method", "status", "transaction_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    # Check if payment already exists
    if @order.payment.present?
      return render json: { error: 'Payment already exists for this order' }, status: :unprocessable_entity
    end

    @payment = @order.build_payment(payment_params)
    @payment.status = 'pending'

    if @payment.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_order
    @order = Order.find(params[:order_id])