backend/app/controllers/api/v1/shipments_controller.rb

  def create
    # Check if shipment already exists
    if @order.shipment.present?
      return render json: { error: 'Shipment already exists for this order' }, status: :unprocessable_entity
    end

    # Ensure order is paid before creating shipment
    unless @order.paid?
      return render json: { error: 'Cannot create shipment for unpaid order' }, status: :unprocessable_entity
    end

    @shipment = @order.build_shipment(shipment_params)
    @shipment.status = 'pending'

    if @shipment.save
---
SELECT "shipments".* FROM "shipments" WHERE "shipments"."order_id" = ? LIMIT ?  [["order_id", 2], ["LIMIT", 1]]
INSERT INTO "shipments" ("order_id", "tracking_number", "carrier", "status", "estimated_delivery", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @shipment.update(shipment_params)
---
UPDATE "shipments" SET "tracking_number" = ?, "status" = ?, "updated_at" = ? WHERE "shipments"."id" = ?  [["tracking_number", "TRK123456789"], ["status", "shipped"], ["updated_at", "2025-03-11 01:10:51.452353"], ["id", 1]]

  def set_order
    @order = Order.find(params[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]